#include <iostream>
using namespace std;
// Подключает простанство имен std иначе нужно писать std::
int main()
{
	//Добавляем русский язык в консоль
	setlocale(LC_ALL, "Russian");
	cout << "---------------------Задание 1-----------------" << endl;
	cout << "\n\t\"To be\n\t\tor not\n\t\t\tto be...\"\n \t\t\t\t / Shakespeare /" << endl;
	cout << " \n";
	cout << "---------------------Задание 2-----------------" << endl;
	cout << "I love C++!\n\n\tI love C++!\n\n\t\tI love C++!\n\n\t\t\tI love C++!\n\n\t\t\t\tI love C++!" << endl;
	cout << " \n";
	cout << "---------------------Задание 3-----------------" << endl;
	cout << "\t\'\\t\', \'\\n\', \'\\\\\', \'\\\'\', \'\\\"\'." << endl;
	cout << " \n";
	cout << "---------------------Задание 4-----------------" << endl;
	cout << "#include <iostream>\nusing namespace std;\n\nint main()\n{\n\tcout << \"\\t\\\'\\\\t\\', \\\'\\\\n\\\', \\\'\\\\\\\\\\\', \\\'\\\\\\\'\\\', \\\'\\\\\\\"\\\'.\" << endl;\n\treturn 0;\n} " << endl;
	cout << " \n";
	cout << "---------------------Задание 5-----------------" << endl;
	cout << "                    МАЙ 2021                   " << endl;
	cout << "  ПН    ВТ      СР      ЧТ     ПТ     СБ   ВС  " << endl;
	cout << "  31    1       2       3      4      5    6   " << endl;
	cout << "  7     8       9       10     11     12   13  " << endl;
	cout << "  14    15      16      17     18     19   20  " << endl;
	cout << "  21    22      23      24     25     26   27  " << endl;
	cout << "  28    29      30      1      2      3    4   " << endl;
	cout << " \n";
	cout << "---------------------Задание 6-----------------" << endl;
	cout << "        / \\                   00000000000      " << endl;
	cout << "       /   \\                   000000000       " << endl;
	cout << "      /     \\                   0000000        " << endl;
	cout << "     /_______\\ ________           |  | 00      " << endl;
	cout << "    |   ___   |    ^   |          |  |/        " << endl;
	cout << "    |  |   |  |   / \\  |  _______ |__|______   " << endl;
	cout << "    |  |___|  |  |_|_| | |__|__|__|__|__|___|  " << endl;
	cout << "    |_________|__|_|_|_| |  |  |  |  |  |   |  " << endl;
	cout << " \n";
	cout << "---------------------Задание 7-----------------" << endl;
	cout << "                  Смаглий Петр                 " << endl;
	cout << "                  /         \\                 " << endl;
	cout << "                 /           \\                " << endl;
	cout << "           Отец Дима        Мама Лена          " << endl;
	cout << "            /      \\       /      \\         " << endl;
	cout << "        Дедушка Всеволод    Бабушка Наташа    " << endl;
	cout << " \n";

	cout << "      -------------------- - Задание 7---------------- " << endl;
	cout << "    ***************   ************  *************        ********    " << endl;
	cout << "    ***************   ************  *************       **********      " << endl;
	cout << "    **           **   **                 **             **      **       " << endl;
	cout << "    **           **   **                 **             **      **            " << endl;
	cout << "    **           **   ************       **            ***********       " << endl;
	cout << "    **           **   ************       **           **        **            " << endl;
	cout << "    **           **   **                 **          **         **         " << endl;
	cout << "    **           **   **                 **          **         **        " << endl;
	cout << "    **           **   ************       **          **         **         " << endl;
	cout << "    **           **   ************       **          **         **     " << endl;
	cout << " \n";

	cout << "---------------------Задание 8-----------------" << endl;
	cout << " ***************           " << endl;
	cout << "               **       " << endl;
	cout << "                 **      " << endl;
	cout << "                  ****************** " << endl;
	cout << "                  *                * " << endl;
	cout << "                  *                * " << endl;
	cout << "                  ****************** " << endl;
	cout << " \n";
	cout << "---------------------Задание 9-----------------" << endl;
	cout << " Имя: Петр " << endl;
	cout << " Фамилия: Смаглий " << endl;
	cout << " Год рождение: 10.11.2001 " << endl;
	cout << " Номер телефона: +380932768455 " << endl;
	cout << " Опыт работы: отсутствует" << endl;
	cout << " Имеется высшее образование в сфере IT" << endl;
	return 0;
	// Возвращает 0 как результат работы функции, считается, что функция отработала успешно если назад был возвращен 0.
}